[
{"url": "https://www.zillow.com/homedetails/2817-Jay-Ave-Cleveland-OH-44113/2055290457_zpid/", "address": "2817 Jay Ave, Cleveland, OH 44113", "price": "799000", "beds": "3", "baths": "3", "sqft": "2934", "description": "Location, location, location! Gorgeous updated luxury duplex with central air, skylights, vaulted ceilings, & tons of character due to its roots as a blacksmith barn & shop: exposed original brick, exposed original beams, exposed barn wood feature walls. Located less than a 2 minute drive to West Side Market & The Flats; 5 minute drive to all sporting venues, Playhouse Square, & Cleveland State University; less than 15 minute drive to Cleveland Clinic, Case Western University, University Hospital, University Circle, & Metro Hospital! This cedar sided fully fenced property has a gorgeous private landscaped courtyard with landscape lighting & irrigation system; a 900 sq ft 2-story 1 bedroom 1 bath unit at the back of the property with private entrance, open floor plan, a dining area for two, living area with Vermont Stove style gas fireplace & sliding glass doors to the courtyard, kitchenette, 2nd floor lofted office, vaulted bedroom, & updated en-suite bath; a 2100 sq ft front unit with private entrance, open floor plan, great room, updated kitchen, & original staircase to two 2nd floor bedroom suites (one with walk-in closet & electric fireplace) both with updated private luxury spa baths. A possible 3rd unit with separate entrance could be used to enlarge the living space of either (or both) front & rear units or be opened up completely to convert this duplex to a single family home. Kitchens, baths, windows updated in 2016-2018; roof, gutters & leaf guards replaced in 2020.", "year_built": "1900", "property_subtype": "duplex", "region": "Cleveland", "subdivision": null, "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/5009-Franklin-Blvd-Cleveland-OH-44102/33329601_zpid/", "address": "5009 Franklin Blvd, Cleveland, OH 44102", "price": "509900", "beds": "4", "baths": "3", "sqft": "2915", "description": "Large Victorian home featuring main unit and efficiency apartment. Main unit has 3-bedrooms and 1.5 bathrooms. Tall ceilings, beautiful woodwork, doors, interior original wood shutters. 8 rooms total in main unit. One bedroom efficiency in back with separate gas, electric, and entrance.", "year_built": "1893", "property_subtype": "duplex", "region": "Cleveland", "subdivision": "Ohio City", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/5013-Franklin-Ave-Cleveland-OH-44102/2054080361_zpid/", "address": "5013 Franklin Ave, Cleveland, OH 44102", "price": "349900", "beds": "3", "baths": "2", "sqft": "1785", "description": "This ‘Victorian Shadow’ is sure to please. Modest 2-bedroom, 1-bathroom, single family house. Detached efficiency ‘Barn’ rental with 1-bedroom apartment on property. This offering includes adjacent lot with ample parking and green space. Both units tenant occupied. Separate gas and electric.", "year_built": "1900", "property_subtype": "duplex", "region": "Cleveland", "subdivision": "Ohio City", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null}
]