[
{"url": "https://www.zillow.com/homedetails/6911-Franklin-Blvd-Cleveland-OH-44102/2067684568_zpid/", "address": "6911 Franklin Blvd, Cleveland, OH 44102", "price": "525000", "beds": "6", "baths": "4", "sqft": "3976", "description": "Wonderful Opportunity to Occupy or Invest in Detroit Shoreway Near Gordan Square.  This Four Unit Has 2-One Bedrooms Units on the First Floor with Access to the Basement Where an Additional Bedroom Can Be Added and 2- Two Bedrooms Units on the Second Floor with Attic Space and the Option to Create a 3rd Bedroom.  Windows, Roof, Mechanicals and Systems Replaced/ Updated Over the Past 10 years.  A Good Investment, Great Location. 3.5 miles from downtown, 1 mile to Edgewater State Park and Beach,6-minute bike ride, just a 1/3 mile to Gordon Square Arts District with Shops, Theaters, Eateries, pubs and all sorts of cool places! This property is close to many destinations.", "year_built": "1892", "property_subtype": "Quadruplex, Multi Family", "region": "Cleveland", "subdivision": "Gordon", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/2118-W-17th-St-Cleveland-OH-44113/2054289308_zpid/", "address": "2118 W 17th St, Cleveland, OH 44113", "price": "459000", "beds": "6", "baths": "4", "sqft": "2704", "description": "Calling all investors! Check out this Duck Island gem, three houses with one being a duplex, on one large lot! There are 2 houses in the front and a cottage house in the back. The first unit is a single family house which offers 728 square feet with 2 bedrooms, a full bathroom, living room, eat in kitchen, dining room, and the potential for additional space in the unfinished attic which is plumbed for a half bathroom.  The second unit is a duplex that has 720 square feet per unit.  One unit offers 2 bedrooms woth spacious walk in closets, a 1 full bath kitchen, living room and dining room. The other has 1 bedroom, 1 bathroom, kitchen, living room and dining room. The back carriage house is a single family home 536 square feet with a nice kitchen, living room, one bedroom and one bathroom. If you are looking for green space, look no further. The backyard offers a huge common green space for relaxing, and also a private green space for the cottage house. The properties have been maintained well. Updates through the years have been newer kitchens, bathrooms, electric panels, furnaces, hot water tanks, and more. Close to all the attractions including some of the areas best restaurants, coffee shops, and parks. A shared common laundry is available in the basement of the duplex. All appliances stay including washer and dryer. This is a gold mine! Come make this home and use the rent to pay your mortgage, or add it to your portfolio, or tear down and start fresh in a thriving area.", "year_built": "1890", "property_subtype": "Quadruplex, Multi Family", "region": "Cleveland", "subdivision": null, "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/1304-W-73rd-St-Cleveland-OH-44102/33327690_zpid/", "address": "1304 W 73rd St, Cleveland, OH 44102", "price": "240000", "beds": "6", "baths": "2", "sqft": "2736", "description": "Location, Location, Location! Investment opportunity located in the desirable Detroit-Shoreway/Gordon Sq. renovation project to take advantage of the increasing values and rising rents in the booming area. Upstairs unit has unfinished attic space that can be converted to additional living space. Prime location that provides easy access to bars, restaurants, coffee shops, theaters, Edgewater beach, and much more! Bring your ideas and creativity to discover the endless opportunities that this property offers. Selling \"AS IS\"", "year_built": "1910", "property_subtype": "Duplex, Multi Family", "region": "Cleveland", "subdivision": "Guardian Allotment/M Ramseys", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/3257-W-43rd-St-Cleveland-OH-44109/33350919_zpid/", "address": "3257 W 43rd St, Cleveland, OH 44109", "price": "90000", "beds": "4", "baths": "2", "sqft": "2834", "description": "Investment opportunity for this duplex.  Rent is month-to-month and this property is priced to move.  House is being sold \"As-Is\".  All information is deemed to be accurate, but is not guaranteed.", "year_built": "1915", "property_subtype": "Duplex, Multi Family", "region": "Cleveland", "subdivision": "Selden Allotment", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/6615-Clark-Ave-Cleveland-OH-44102/299235047_zpid/", "address": "6615 Clark Ave, Cleveland, OH 44102", "price": "44999", "beds": "4", "baths": "4", "sqft": "2650", "description": "Come Get Your Next Potential Cash Cow!!! Investors! Located near some of NE Ohio's most trendy areas, this home is sure to produce great return once brought back to its glory. Exterior of main building has been freshly painted. This home not only has 4 apartments, it also includes a retail space with a half bath giving a 5th source of income. 2 units up are studio apartments with full bath and down units are 1 bed with a full bath. Come get this one while you can! There was damage to 1 unit upstairs from a fire as shown in the photos, however; the foundation and structural integrity appears to not have been disrupted.", "year_built": "1900", "property_subtype": "Quadruplex, Multi Family", "region": "Cleveland", "subdivision": "Hoyt", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/5911-Madison-Ave-Cleveland-OH-44102/33328802_zpid/", "address": "5911 Madison Ave, Cleveland, OH 44102", "price": "172000", "beds": "4", "baths": "1", "sqft": "2205", "description": "A Hidden Gem for Investors: Unlock the Promise in Cleveland's Eco Village! Here's an exceptional chance for shrewd investors and creative homeowners, nestled in the celebrated Gordon Square Arts District. This property features a single house at the front, with space at the back where a previous structure once stood, offering a unique dual-income possibility. The front house needs some care but holds great promise. With a little renovation, it could potentially yield around $1,500/month. The real excitement lies at the back of the property. This blank space, where a building once existed, is ripe for your creative vision. Consider these options: 1. Personal Touch: Transform this space into your own residence or an extension of the current house. 2. New Rental Opportunity: Invest in developing a new rental unit to tap into a profitable market. 3. A Clean Slate: Opt for a full teardown and construct a modern duplex or multifamily unit. Seize this opportunity in a bustling area, ripe for the right visionary. The property is sold as-is. Schedule your visit now. Note: Photos of the front house may be more flattering than reality. Renovations adhere to Section 8 standards, so they might not be as high-end as they appear.\"Schedule your showing TODAY.", "year_built": "1921", "property_subtype": "Duplex, Multi Family", "region": "Cleveland", "subdivision": null, "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/4219-Cyril-Ave-Cleveland-OH-44109/33336912_zpid/", "address": "4219 Cyril Ave, Cleveland, OH 44109", "price": "29900", "beds": "4", "baths": "2", "sqft": "2140", "description": "2 family home in the Clark/West 44th area of Cleveland.  This property is eligible under the Freddie Mac First Look Initiative Program through 2/28/2024.  Property sold \"as-is\".  Seller will make no repairs.", "year_built": "1890", "property_subtype": "Duplex, Multi Family", "region": "Cleveland", "subdivision": "Rhodes-Hartnell Barbers", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null},
{"url": "https://www.zillow.com/homedetails/1735-Buhrer-Ave-Cleveland-OH-44109/33337952_zpid/", "address": "1735 Buhrer Ave, Cleveland, OH 44109", "price": "41600", "beds": "3", "baths": "2", "sqft": "1626", "description": "Welcome to this aluminum-sided colonial duplex with a world of potential. A front porch welcomes you into this property, where each floor offers its own distinct layout and charm. The first floor boasts two bedrooms, a living room, and a dining room, providing ample space for comfortable living. Meanwhile, the second floor features one bedroom, a living room, and an eat-in kitchen, offering cozy and convenient accommodations. The full unfinished basement provides additional storage space and potential for further development. Outside, the partially fenced yard and large yard offer plenty of space for outdoor activities and relaxation. While this property is in need of rehabilitation, it presents an exciting opportunity to restore and customize according to your preferences. With its versatile layout and ample space, this colonial duplex holds promise for a variety of uses and configurations.", "year_built": "1890", "property_subtype": "Duplex, Multi Family", "region": "Cleveland", "subdivision": "Brooklyn", "tax_url": null, "tax": null, "rent_url": null, "rent": null, "min_rent": null, "max_rent": null}
]