[
{"url": "https://www.zillow.com/homedetails/1356-W-64th-St-Cleveland-OH-44102/33327949_zpid/", "address": "1356 W 64th St, Cleveland, OH 44102", "price": "459000", "beds": "5", "baths": "3", "sqft": "2700", "description": "Located in the heart of downtown Gordon Square on W64th is this well maintained, large and updated duplex with long-term month to month tenants! The lower unit offers a large sitting porch, original & beautifully kept hardwood floors, updated kitchen, granite tops, all appliances, formal dining space nicely appointed bedrooms and an updated bath. The upper unit is equally adorned with original hardwoods, updated kitchen with subway tile backsplash, granite tops, new cabinetry, formal dining and living rooms. Two bedrooms on the main floor and a large upper level sitting deck! The third floor of the upper unit offers a rare additional bedroom and full bath! Off street parking, a two-car garage and proximity to the Edgewater beach tow path and downtown Gordon Square don't get much better than this! Situated on a very quiet and well-maintained street in the heart of it all.!", "year_built": "1910", "property_subtype": "duplex", "region": "Cleveland", "subdivision": "Perkins", "tax_url": "https://www.countyoffice.org/property-record-1356-w-64th-st-cleveland-oh-44102-515/", "tax": "3942", "rent_url": "https://www.zillow.com/rental-manager/price-my-rental/results/1356-w-64th-st-cleveland-oh-44102/", "rent": "3197", "min_rent": "2247", "max_rent": "5606"},
{"url": "https://www.zillow.com/homedetails/1276-W-67th-St-Cleveland-OH-44102/33327904_zpid/", "address": "1276 W 67th St, Cleveland, OH 44102", "price": "489000", "beds": "5", "baths": "2", "sqft": "1559", "description": "Prime Investment Opportunity: This impeccable ranch duplex in Gordon Square's vibrant Little Italy Art District boasts exceptional value. The rear three-bedroom unit, updated in 2019 and freshly painted in 2023, awaits its new occupants. Meanwhile, the front two-bedroom unit is already leased to a fantastic tenant and underwent a thorough renovation in 2019.\r\nBoth units share a fully equipped basement featuring two washing machines and dryers for added convenience. Each boasts modern upgrades, including Pergo flooring, upgraded electrical panels, soft-close cabinets, and granite countertops in the kitchens. The bathrooms are adorned with stylish tile surrounds and updated vanities.  Newer vinyl windows and glass block basement windows.\r\nThe property includes two furnaces, one of which is a high-efficiency unit installed in 2019, along with two hot water tanks also updated in 2019. Newly installed separate A/C systems in 2019 ensure optimal comfort for both units. Furthermore, the basement has been waterproofed, featuring a 2022 wifi monitored sump pump and commercial dehumidifier, while the wide cement driveway and fenced backyard offer added appeal and practicality.\r\nThis sought-after location provides easy access to the local gems of Gordon Square, including renowned dining spots like Mad Stone and Il Rione’s Pizzeria, as well as The Edison at Gordon Square and Battery Park. Moreover, its proximity to the lake, Edgewater Park, and the bustling amenities of Gordon Square in Ohio City makes it an enviable spot. Additionally, it's just minutes away from the vibrant pulse of Downtown, ensuring a perfect blend of convenience and urban lifestyle.", "year_built": "1900", "property_subtype": "duplex", "region": "Cleveland", "subdivision": "Alger", "tax_url": "https://www.countyoffice.org/property-record-1276-w-67th-st-cleveland-oh-44102-4cb/", "tax": "6187", "rent_url": "https://www.zillow.com/rental-manager/price-my-rental/results/1276-w-67th-st-cleveland-oh-44102/", "rent": "3441", "min_rent": "2125", "max_rent": "5606"},
{"url": "https://www.zillow.com/homedetails/6911-Franklin-Blvd-Cleveland-OH-44102/2067684568_zpid/", "address": "6911 Franklin Blvd, Cleveland, OH 44102", "price": "525000", "beds": "6", "baths": "4", "sqft": "3976", "description": "Wonderful Opportunity to Occupy or Invest in Detroit Shoreway Near Gordan Square.  This Four Unit Has 2-One Bedrooms Units on the First Floor with Access to the Basement Where an Additional Bedroom Can Be Added and 2- Two Bedrooms Units on the Second Floor with Attic Space and the Option to Create a 3rd Bedroom.  Windows, Roof, Mechanicals and Systems Replaced/ Updated Over the Past 10 years.  A Good Investment, Great Location. 3.5 miles from downtown, 1 mile to Edgewater State Park and Beach,6-minute bike ride, just a 1/3 mile to Gordon Square Arts District with Shops, Theaters, Eateries, pubs and all sorts of cool places! This property is close to many destinations.", "year_built": "1892", "property_subtype": "quadruplex", "region": "Cleveland", "subdivision": "Gordon", "tax_url": "https://www.countyoffice.org/property-record-6911-franklin-blvd-cleveland-oh-44102-2dc/", "tax": "4600", "rent_url": "https://www.zillow.com/rental-manager/price-my-rental/results/6911-franklin-blvd-cleveland-oh-44102/", "rent": "3689", "min_rent": "2355", "max_rent": "5606"},
{"url": "https://www.zillow.com/homedetails/1304-W-73rd-St-Cleveland-OH-44102/33327690_zpid/", "address": "1304 W 73rd St, Cleveland, OH 44102", "price": "240000", "beds": "6", "baths": "2", "sqft": "2736", "description": "Location, Location, Location! Investment opportunity located in the desirable Detroit-Shoreway/Gordon Sq. renovation project to take advantage of the increasing values and rising rents in the booming area. Upstairs unit has unfinished attic space that can be converted to additional living space. Prime location that provides easy access to bars, restaurants, coffee shops, theaters, Edgewater beach, and much more! Bring your ideas and creativity to discover the endless opportunities that this property offers. Selling \"AS IS\"", "year_built": "1910", "property_subtype": "duplex", "region": "Cleveland", "subdivision": "Guardian Allotment/M Ramseys", "tax_url": "https://www.countyoffice.org/property-record-1304-w-73rd-st-cleveland-oh-44102-33d/", "tax": "2550", "rent_url": "https://www.zillow.com/rental-manager/price-my-rental/results/1304-w-73rd-st-cleveland-oh-44102/", "rent": "1210", "min_rent": "950", "max_rent": "1853"}
]