[
    {"url": "https://proxy.scrapeops.io/v1/?api_key=d875dca3-61b5-4126-9181-24e588fe58d3&url=https%3A%2F%2Fwww.zillow.com%2Fhomedetails%2F1486-Olivewood-Ave-Lakewood-OH-44107%2F33499525_zpid%2F", "address": "1486 Olivewood Ave, Lakewood, OH 44107", "price": "435000", "beds": "6", "baths": "2", "sqft": "2408", "description": "Wonderful opportunity to own this side by side two family home located close to schools, parks, shopping and all of your entertainment action that Lakewood offers. This great duplex is ready for an investor or owner occupant to take over. Deck in back for summer fun, and don't miss the huge front porch! Each unit offers 3 bedrooms, 1 bathroom, family room, kitchen and dining area. Minutes away from Lakewood high school.", "year_built": "1905", "property_subtype": "duplex", "region": "Lakewood", "subdivision": "Hambys Lakewood"},
    {"url": "https://proxy.scrapeops.io/v1/?api_key=d875dca3-61b5-4126-9181-24e588fe58d3&url=https%3A%2F%2Fwww.zillow.com%2Fhomedetails%2F12929-Plover-St-Lakewood-OH-44107%2F33504136_zpid%2F", "address": "12929 Plover St, Lakewood, OH 44107", "price": "265000", "beds": "4", "baths": "2", "sqft": "2022", "description": "Great opportunity to own a piece of history in Booming lakewood. Great investment or live in one of the units\r\nand have the other unit pay your mortgage. Short distance to Madison park and downtown Lakewood. Minutes\r\nfrom downtown Cleveland, I 90 and Hopkins airport. Duplex Has 2 Bed 1 Bath Dn, Up Unit Can Be Effic Or In Law\r\nSuite. Needs TLC. Bring All Offers to Motivated Seller. This property features two units and Three car garage.\r\nNew driveway in 2022 and garage doors in 2022. This home is waiting for your decorating touches priced well\r\nbelow market value for Lakewood.", "year_built": "1906", "property_subtype": "duplex", "region": "Lakewood", "subdivision": "Pleasant Hills Allotment"},
    {"url": "https://proxy.scrapeops.io/v1/?api_key=d875dca3-61b5-4126-9181-24e588fe58d3&url=https%3A%2F%2Fwww.zillow.com%2Fhomedetails%2F2040-Marlowe-Ave-Lakewood-OH-44107%2F33500906_zpid%2F", "address": "2040 Marlowe Ave, Lakewood, OH 44107", "price": "399500", "beds": "6", "baths": "3", "sqft": "4270", "description": "Located in the vibrant city of Lakewood, this renovated side-by-side duplex offers an ideal worry-free living experience. Whether you chose to reside in one unit and rent out the other, or to rent both for a steady income stream, this property guarantees convenience and affordability. With a newer roof and renovations, the pleasant living areas feature an updated carpet installed by Lowes and newer bathrooms. Additionally, the detached two-car garage in the rear provides secure and hassle free parking options offering a piece of mind.", "year_built": "1920", "property_subtype": "duplex", "region": "Lakewood", "subdivision": null},
    {"url": "https://proxy.scrapeops.io/v1/?api_key=d875dca3-61b5-4126-9181-24e588fe58d3&url=https%3A%2F%2Fwww.zillow.com%2Fhomedetails%2F2200-Lewis-Dr-Lakewood-OH-44107%2F33503639_zpid%2F", "address": "2200 Lewis Dr, Lakewood, OH 44107", "price": "409900", "beds": "5", "baths": "2", "sqft": "2500", "description": "Wonderful opportunity to own this totally updated 2 family home located within walking distance to schools, parks, library and of the shopping and entertainment action that lakewood offers. The first floor unit offers 2 large bedrooms living room dining room state-of-the-art kitchen that features tall platinum shaker cabinets with quartz countertops and stainless appliances. The second floor unit offers the same layout plus a finished third floor adding another 500sf of living space. Beautiful original hardwood floors throughout both units. Both units can enjoy the enclosed front porch and balcony plus a huge rear deck perfect for entertaining. Recent updates include the new windows, updated both kitchens, updated both bathrooms, new light fixtures, refinished the hardwood floors, new AC units, bew hot water tank, new carpeting on third floor, fresh paint and much much more. Call for your private tour.", "year_built": "1924", "property_subtype": "duplex", "region": "Lakewood", "subdivision": "Land And Home Company's Sub #1"},
    {"url": "https://proxy.scrapeops.io/v1/?api_key=d875dca3-61b5-4126-9181-24e588fe58d3&url=https%3A%2F%2Fwww.zillow.com%2Fhomedetails%2F1233-Granger-Ave-Lakewood-OH-44107%2F33489850_zpid%2F", "address": "1233 Granger Ave, Lakewood, OH 44107", "price": "325000", "beds": "3", "baths": "2", "sqft": "2675", "description": "Nestled in the heart of Lakewood, this multifamily home combines historical charm with modern elegance. Built in 1917, this property offers the unique appearance of a single-family home with the functionality and flexibility of a multifamily residence, making it an ideal investment or living solution. This property represents an attractive investment opportunity, as it is fully tenanted: both are on a month-to-month lease. This setup offers immediate income generation, with the flexibility to continue renting or occupy the property. Whether you're looking for an investment property or a multi-generational home, this multifamily residence offers flexibility, charm, and convenience. With its blend of historical architecture and modern conveniences, alongside its unbeatable location, this multifamily home offers both charm and practicality. Schedule a showing today and discover how this property can be your next home or investment opportunity. Truly a MUST SEE!", "year_built": "1917", "property_subtype": "duplex", "region": "Lakewood", "subdivision": "Atwell"},
    {"url": "https://proxy.scrapeops.io/v1/?api_key=d875dca3-61b5-4126-9181-24e588fe58d3&url=https%3A%2F%2Fwww.zillow.com%2Fhomedetails%2F11801-Franklin-Blvd-Lakewood-OH-44107%2F33503273_zpid%2F", "address": "11801 Franklin Blvd, Lakewood, OH 44107", "price": "289000", "beds": "4", "baths": "2", "sqft": "2086", "description": "Great investment property for a savvy investor or live in one unit and rent the other! Beautiful hardwood floors throughout this spacious double. Each unit has a living room with decorative fireplace and built-in shelves. Formal dining room highlighted by built in cabinets with leaded glass doors. Kitchen with granite countertop, stove and fridge included. First floor unit has 2 bedrooms and one full bath, second floor unit with 3 bedrooms and one full bath. Third floor is finished but does not have a heat source. Great location with easy freeway access and minutes to downtown.", "year_built": "1923", "property_subtype": "duplex", "region": "Lakewood", "subdivision": "Rockport Sec 21"}
]