[
{"url": "https://www.zillow.com/homedetails/2123-2125-Glouchester-Ave-Columbus-OH-43229/33933414_zpid/", "address": "2123-2125 Glouchester Ave, Columbus, OH 43229", "price": "365000", "beds": null, "baths": null, "sqft": "2078", "description": "Fantastic investment opportunity. Sought after brick & stucco ranch duplex in Sharon Woods sub. Each unit has 2 bedrooms,1 bath, LR, eat in kitchen, 1 car attached garage and unfinished basement with washer /dryer hookups.  One unit rents for $ 950, leased thru 2025. The other unit rents for $ 1425/month, leased through 2024. Tenants pay utilities, except water and sewer. Due to a fire, unit 2125 has been totally updated: electrical, plumbing, drywall, cabinets, flooring and HVAC system. Unit 2123-new windows and new HVAC system. New roof -installed in 2021. Exterior-recently painted. New gutters, gutter guards and downspouts. Curb offers only. Offer contingent upon Buyers inspection and acceptance and subject to Tenants' Rights. Please do not disturb tenants.  Owner is licensed agent.", "year_built": "1973", "property_subtype": "duplex", "region": "Columbus", "subdivision": "Sharon Woods"},
{"url": "https://www.zillow.com/homedetails/629-S-Wheatland-Ave-Columbus-OH-43204/341047074_zpid/", "address": "629 S Wheatland Ave, Columbus, OH 43204", "price": "90000", "beds": null, "baths": null, "sqft": "1286", "description": "THE REALTOR IS THE RECEIVER APPOINTED BY THE FRANKLIN COUNTY MUNICIPAL COURT, ENVIRONMENTAL DIVISION. Great opportunity to make this property your own. New roof, siding, mortar work throughout, and the interior has been cleaned out. Due to the court approval process, this is not a quick close. The Receiver requests for in-state buyers only. **SEE AGENT TO AGENT REMARKS**", "year_built": "1950", "property_subtype": null, "region": "Columbus", "subdivision": null},
{"url": "https://www.zillow.com/homedetails/2243-2245-N-Lexington-Ave-Columbus-OH-43211/33870795_zpid/", "address": "2243-2245 N Lexington Ave, Columbus, OH 43211", "price": "128000", "beds": "2", "baths": "2", "sqft": "896", "description": "The perfect investment opportunity in Columbus, Ohio! This delightful duplex, nestled on a generous .13-acre lot, is now available for sale. There is a 10% Buyers Premium added to the sale price to create the final contract price. With each unit featuring 1 bedroom and 1 bathroom, this property is a fantastic prospect for both experienced investors. Double Income Potential: With two separate units, you can maximize your rental income, making it a smart choice for investors looking to diversify their portfolio. Cozy Living Spaces: Each unit offers a comfortable living space with 1 bedroom and 1 bathroom. At 896 square feet, you'll find a welcoming and functional design.", "year_built": "1951", "property_subtype": "duplex", "region": "Columbus", "subdivision": "South Linden"},
{"url": "https://www.zillow.com/homedetails/925-927-Mount-Pleasant-Ave-Columbus-OH-43201/2065334072_zpid/", "address": "925-927 Mount Pleasant Ave, Columbus, OH 43201", "price": "825000", "beds": null, "baths": null, "sqft": "4730", "description": "Rare opportunity in Italian Village for a huge brick duplex consisting of 2 condominium units. 2 parcels! Keep one, sell one, rent both out, short term rental, the opportunities are endless! Each condo is a spacious 3 bedroom, 2.5 bathroom with several recent updates. Perfect example of a historic home, with modern touches. Each unit has a full basement, above grade washing machine and dryer, exposed brick, front porch, beautiful woodwork, central A/C, and large rooms. Both condos total 4,730 sq ft!. The 927 side is rented at $3,290/month expiring June of 2024 and 925 is ready for an owner occupant or turnkey rental. Broker Owned", "year_built": "1900", "property_subtype": "duplex", "region": "Columbus", "subdivision": "Italian Village / Short North"},
{"url": "https://www.zillow.com/homedetails/2013-2015-Floral-Ave-Columbus-OH-43223/33842511_zpid/", "address": "2013-2015 Floral Ave, Columbus, OH 43223", "price": "110000", "beds": null, "baths": null, "sqft": "1992", "description": "Calling all investors, rehabbers, & landlords. This property near Wrexham Park & Glenwood Community Center is in an area poised for additional growth & presents a substantial equity opportunity based on renovated comparables. Good as a buy & hold or flip, this will be a great canvas for your next project. Needs to be renovated to get it market or rent-ready, and is priced accordingly. Being sold AS-IS. See A2A.", "year_built": "1924", "property_subtype": null, "region": "Columbus", "subdivision": "Glenwood Hts/Central Hilltop"},
{"url": "https://www.zillow.com/homedetails/1555-Neil-Ave-Columbus-OH-43201/296629028_zpid/", "address": "1555 Neil Ave, Columbus, OH 43201", "price": "1495000", "beds": null, "baths": null, "sqft": "5423", "description": "Absolutely perfect location tucked up to the Med Complex at OSU. Ideal Property for AirBNB, VRBO or short term rental.  Currently Self-Managed as long term rentals.  Rents are low.  Two Buidlings on one lot.  1 Up/Down Duplex  W coverd parking.  1 Beutiful victorian split into 5 Units.", "year_built": "1900", "property_subtype": "duplex", "region": "Columbus", "subdivision": null},
{"url": "https://www.zillow.com/homedetails/42-44-Dakota-Ave-Columbus-OH-43222/33854679_zpid/", "address": "42-44 Dakota Ave, Columbus, OH 43222", "price": "300000", "beds": null, "baths": null, "sqft": "2002", "description": "Duplex with 3 bedrooms, 1 full bathroom, off street parking, back porch and basement on each side. Located in close proximity to Downtown Columbus and walking distance to local cafes. Both sides fully occupied, please do not disturb residents, interior photos are of unit 42. Curb offers only. See A2A for lease details", "year_built": "1913", "property_subtype": "duplex", "region": "Columbus", "subdivision": null},
{"url": "https://www.zillow.com/homedetails/2651-2653-N-4th-St-Columbus-OH-43202/33831440_zpid/", "address": "2651-2653 N 4th St, Columbus, OH 43202", "price": "355000", "beds": null, "baths": null, "sqft": "2080", "description": "INVESTMENT OPPORTUNITY!  Well Maintained Duplex on a Charming, Quiet Section of North 4th Street, Just Steps Away From Picturesque Glen Echo Park.  Everyone Loves a Welcoming Front Porch.  Each Unit's Entry Level Features a Spacious Family Room, Dining Area, and Kitchen with Laminate Flooring. The Second Floor Has Two Bedrooms and a Full Bathroom. Both Basements Offer Ample Storage and Laundry Space. Each unit has Gas Heat, Central Air, and Off-Street Parking. Current Rents are $1200/month per Unit. This Property Generates a Solid Income Stream With Upside Potential on Rents. The lease for 2653 North 4th expires 6/24/24. The lease for 2651 North 4th expires 7/26/24. GREAT Future Owner Occupant Opportunity OR a Turnkey Rental!   PLEASE DO NOT DISTURB TENANTS.", "year_built": "1918", "property_subtype": "duplex", "region": "Columbus", "subdivision": null}
]