[
{"url": "https://www.zillow.com/homedetails/2040-Marlowe-Ave-Lakewood-OH-44107/33500906_zpid/", "address": "2040 Marlowe Ave, Lakewood, OH 44107", "price": "$399,500", "beds": "6", "baths": "3", "sqft": "4,270 sqft", "description": "Located in the vibrant city of Lakewood, this renovated side-by-side duplex offers an ideal worry-free living experience. Whether you chose to reside in one unit and rent out the other, or to rent both for a steady income stream, this property guarantees convenience and affordability. With a newer roof and renovations, the pleasant living areas feature an updated carpet installed by Lowes and newer bathrooms. Additionally, the detached two-car garage in the rear provides secure and hassle free parking options offering a piece of mind.", "year_built": "1920", "property_subtype": "Duplex, Multi Family", "region": "Lakewood", "subdivision": null, "tax_url": "https://www.countyoffice.org/property-record-2040-marlowe-ave-lakewood-oh-44107-b65/", "tax": "5215"},
{"url": "https://www.zillow.com/homedetails/1486-Olivewood-Ave-Lakewood-OH-44107/33499525_zpid/", "address": "1486 Olivewood Ave, Lakewood, OH 44107", "price": "$435,000", "beds": "6", "baths": "2", "sqft": "2,408 sqft", "description": "Wonderful opportunity to own this side by side two family home located close to schools, parks, shopping and all of your entertainment action that Lakewood offers. This great duplex is ready for an investor or owner occupant to take over. Deck in back for summer fun, and don't miss the huge front porch! Each unit offers 3 bedrooms, 1 bathroom, family room, kitchen and dining area. Minutes away from Lakewood high school.", "year_built": "1905", "property_subtype": "Duplex, Multi Family", "region": "Lakewood", "subdivision": "Hambys Lakewood", "tax_url": "https://www.countyoffice.org/property-record-1486-olivewood-ave-lakewood-oh-44107-607/", "tax": "3592"},
{"url": "https://www.zillow.com/homedetails/12929-Plover-St-Lakewood-OH-44107/33504136_zpid/", "address": "12929 Plover St, Lakewood, OH 44107", "price": "$265,000", "beds": "4", "baths": "2", "sqft": "2,022 sqft", "description": "Great opportunity to own a piece of history in Booming lakewood. Great investment or live in one of the units\r\nand have the other unit pay your mortgage. Short distance to Madison park and downtown Lakewood. Minutes\r\nfrom downtown Cleveland, I 90 and Hopkins airport. Duplex Has 2 Bed 1 Bath Dn, Up Unit Can Be Effic Or In Law\r\nSuite. Needs TLC. Bring All Offers to Motivated Seller. This property features two units and Three car garage.\r\nNew driveway in 2022 and garage doors in 2022. This home is waiting for your decorating touches priced well\r\nbelow market value for Lakewood.", "year_built": "1906", "property_subtype": "Duplex, Multi Family", "region": "Lakewood", "subdivision": "Pleasant Hills Allotment", "tax_url": "https://www.countyoffice.org/property-record-12929-plover-st-lakewood-oh-44107-82e/", "tax": "2248"},
{"url": "https://www.zillow.com/homedetails/2184-Wascana-Ave-Lakewood-OH-44107/33501582_zpid/", "address": "2184 Wascana Ave, Lakewood, OH 44107", "price": "$349,900", "beds": "4", "baths": "2", "sqft": "3,508 sqft", "description": "Welcome to this charming up and down duplex, offering a turnkey property ideal for investment or an owner occupant. Situated in a desirable location, this property boasts two well-maintained units, each featuring 2 bedrooms and 1 bathroom with updated LVT flooring, kitchens and bathrooms. The lower unit offers an additional nook, expanding the living area, while the upper unit boasts a charming screened-in porch. Additionally, both units feature separate laundry facilities and convenient built-in storage.", "year_built": "1923", "property_subtype": "Duplex, Multi Family", "region": "Lakewood", "subdivision": "E G Gilberts 01", "tax_url": "https://www.countyoffice.org/property-record-2184-wascana-ave-lakewood-oh-44107-e07/", "tax": "4870"}
]